Revit 2026 API

# Transform2DIsTranslation Property

---

The boolean value that indicates whether this transformation is a translation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsTranslation { get; }
```
```vb
Public ReadOnly Property IsTranslation As Boolean
	Get
```
```cpp
public:
property bool IsTranslation {
	bool get ();
}
```
```fsharp
member IsTranslation : bool with get
```

#### Property Value

Boolean

This property is true if the only effect of transformation is translation. It checks that the linear part of the transform is identity. The translation vector may be zero (which would make this an identity transformation) or nonzero (which would make this a non-trivial translation).

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace